t21/Walnut_X/Packages/.cache/Keil.Kinetis_K10_DFP.1.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K10_DFP</name>
  <description>Freescale Kinetis K10 Series Device Support</description>

  <releases>
    <release version="1.1.0" date="2014-07-24">
      Added basic device support for MK11DX128Axxx5, MK11DX256Axxx5, MK11DN512Axxx5 devices.
    </release>
    <release version="1.0.0">
      First Release version of K10 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>K10</keyword>
  </keywords>

  <devices>

    <family Dfamily="K10 Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book    name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
      <book    name="Documents\K10PB.pdf"                             title="K10 Family Product Brief"/>

      <!-- ******************************  MK10DN128xxx5  ****************************** -->
      <device Dname="MK10DN128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK10D5.h"  define="MK10DN128xxx5"/>
        <debug      svd="SVD\MK10D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <book    name="Documents\K10P64M50SF0RM.pdf"          title="MK10DN128xxx5  Reference Manual"/>
        <book    name="Documents\K10P64M50SF0.pdf"            title="MK10DN128xxx5  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 50MHz CPU Clock)
 - DSP Support
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA controller
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks
 - 3MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 128 KB program flash.
 - Up to 32 KB FlexNVM on FlexMemory devices
 - 2 KB FlexRAM on FlexMemory devices
 - Up to 16 KB RAM
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 44 GPIO Pin (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK10DN32xxx5  ****************************** -->
      <device Dname="MK10DN32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK10D5.h"  define="MK10DN32xxx5"/>
        <debug      svd="SVD\MK10D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFF000"  size="0x1000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P32_50MHZ.FLM"   start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\K10P64M50SF0RM.pdf"          title="MK10DN32xxx5   Reference Manual"/>
        <book    name="Documents\K10P64M50SF0.pdf"            title="MK10DN32xxx5  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 50MHz CPU Clock)
 - DSP Support
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA controller
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks
 - 3MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 128 KB program flash.
 - Up to 32 KB FlexNVM on FlexMemory devices
 - 2 KB FlexRAM on FlexMemory devices
 - Up to 16 KB RAM
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 44 GPIO Pin (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK10DN64xxx5  ****************************** -->
      <device Dname="MK10DN64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK10D5.h"  define="MK10DN64xxx5"/>
        <debug      svd="SVD\MK10D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P64_50MHZ.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\K10P64M50SF0RM.pdf"          title="MK10DN64xxx5   Reference Manual"/>
        <book    name="Documents\K10P64M50SF0.pdf"            title="MK10DN64xxx5  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 50MHz CPU Clock)
 - DSP Support
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

