t21/Walnut_X/Packages/.cache/Keil.Kinetis_K10_DFP.1.1.0.pdsc
 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA contr. with 16 channels
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks (32kHz or 2MHz)
 - 12MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 512 KB program flash memory on non-
   FlexMemory devices
 - Up to 256 KB program flash memory on
   FlexMemory devices
 - Up to 128 KB RAM
 - Up to 256 KB FlexNVM on FlexMemory devices
 - Up to 128 KB RAM
 - Flash security and protection features
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - CAN
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - 104 GPIO (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK10DX256xxx10  ****************************** -->
      <device Dname="MK10DX256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK10D10.h"  define="MK10DX256xxx10"/>
        <debug      svd="SVD\MK10D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D256.FLM"        start="0x10000000"  size="0x40000"                  default="1"/>
        <book    name="Documents\K10P144M100SF2V2RM.pdf"      title="MK10DX256xxx10 Reference Manual"/>
        <book    name="Documents\K10P144M100SF2V2.pdf"        title="MK10DX256xxx10  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 100MHz CPU Clock)
 - DSP Support, MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
  - 2-pin serial wire debug (SWD)
  - IEEE 1149.1 Joint Test Action Group (JTAG)
  - IEEE 1149.7 compact JTAG (cJTAG)
  - Trace port interface unit (TPIU)
  - Flash patch and breakpoint (FPB)
  - Data watchpoint and trace (DWT)
  - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA contr. with 16 channels
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks (32kHz or 2MHz)
 - 12MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 512 KB program flash memory on non-
   FlexMemory devices
 - Up to 256 KB program flash memory on
   FlexMemory devices
 - Up to 128 KB RAM
 - Up to 256 KB FlexNVM on FlexMemory devices
 - Up to 128 KB RAM
 - Flash security and protection features
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - CAN
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - 104 GPIO (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK10FN1M0xxx12  ****************************** -->
      <device Dname="MK10FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK10F12.h"  define="MK10FN1M0xxx12"/>
        <debug      svd="SVD\MK10F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>
        <book    name="Documents\K10P144M120SF3RM.pdf"        title="MK10FN1M0xxx12 Reference Manual"/>
        <book    name="Documents\K10P144M120SF3.pdf"          title="MK10FN1M0xxx12  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core with FPU (up to 120MHz CPU Clock)
 - MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
  - 2-pin serial wire debug (SWD)
  - IEEE 1149.1 Joint Test Action Group (JTAG)
  - IEEE 1149.7 compact JTAG (cJTAG)
  - Trace port interface unit (TPIU)
  - Flash patch and breakpoint (FPB)
  - Data watchpoint and trace (DWT)
  - Instrumentation trace macrocell (ITM)

