t21/Walnut_X/Packages/.cache/Keil.Kinetis_K10_DFP.1.1.0.pdsc
 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA controller
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks
 - 3MHz to 32MHz crystal osc.
 - 32kHz crystal osc.

 Memories and Memory Interfaces
 - Up to 512 KB of program flash for devices without
   FlexNVM.
 - Up to 256 KB program flash for devices with
   FlexNVM
 - 64 KB FlexNVM on FlexMemory devices
 - 4 KB FlexRAM on FlexMemory devices
 - Up to 64 KB RAM
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 44 GPIO Pin (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK12DN512xxx5  ****************************** -->
      <device Dname="MK12DN512xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK12D5.h"  define="MK12DN512xxx5"/>
        <debug      svd="SVD\MK12D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512_50MHZ.FLM"  start="0x00000000"  size="0x80000"                  default="1"/>
        <book    name="Documents\K12P121M50SF4RM.pdf"         title="MK12DN512xxx5  Reference Manual"/>
        <book    name="Documents\K12P121M50SF4.pdf"           title="MK12DN512xxx5  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 50MHz CPU Clock)
 - DSP Support
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA controller
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks
 - 3MHz to 32MHz crystal osc.
 - 32kHz crystal osc.

 Memories and Memory Interfaces
 - Up to 512 KB of program flash for devices without
   FlexNVM.
 - Up to 256 KB program flash for devices with
   FlexNVM
 - 64 KB FlexNVM on FlexMemory devices
 - 4 KB FlexRAM on FlexMemory devices
 - Up to 64 KB RAM
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flexible timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flexible timer (FTM)
 - Carrier modulator timer (CMT)
 - Programmable delay block (PDB)
 - 1x4ch programmable interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - SPI
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 44 GPIO Pin (pin interrupt support, DMA request capability)
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK12DX128xxx5  ****************************** -->
      <device Dname="MK12DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK12D5.h"  define="MK12DX128xxx5"/>
        <debug      svd="SVD\MK12D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D64_50MHZ.FLM"   start="0x10000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\K12P121M50SF4RM.pdf"         title="MK12DX128xxx5  Reference Manual"/>
        <book    name="Documents\K12P121M50SF4.pdf"           title="MK12DX128xxx5  Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 50MHz CPU Clock)
 - DSP Support
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

