t21/Walnut_X/Packages/.cache/Keil.Kinetis_K10_DFP.1.1.0.pdsc
Human-Machine Interfaces (HMI)
 - General purpose input/output controller
        </description>
      </device>

      <!-- ******************************  MK11DX256Axxx5  ***************************** -->
      <device Dname="MK11DX256Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK11DA5.h"  define="MK11DX256Axxx5"/>
        <debug      svd="SVD\MK11DA5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D64.FLM"         start="0x10000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\K11P121M50SF4V2RM.pdf"         title="MK11DX256Axxx5 Reference Manual"/>
        <book    name="Documents\K11P121M50SF4V2.pdf"           title="MK11DX256Axxx5 Data Sheet"/>
        <description>
ARM Cortex-M4 DSP instruction support, running at up to 50 MHz

System
 - System integration module
 - Power management and mode controllers
 - Multiple power modes available based on run, wait, stop, and powerdown modes
 - Low-leakage wakeup unit
 - Miscellaneous control module
 - Crossbar switch
 - Peripheral bridge
 - Direct memory access (DMA) controller with multiplexer to increase available DMA requests.
 - External watchdog monitor
 - Watchdog

Clocks
 - Multiple clock generation options available from internally- and externally generated clocks
 - System oscillator to provide clock source for the MCU
 - RTC oscillator to provide clock source for the RTC

Security
 - Cyclic Redundancy Check module for error detection
 - Hardware encryption, along with a random number generator
 - Tamper detect and secure storage

Analog
 - High speed analog-to-digital converter
 - Comparator
 - Digital-to-analog converter
 - Internal voltage reference
 - Bandgap voltage reference

Timers
 - Programmable delay block
 - FlexTimers
 - Periodic interrupt timer
 - Low power timer
 - Carrier modulator transmitter
 - Independent real time clock

Communications
 - Serial peripheral interface
 - Inter-integrated circuit (I2C)
 - UART
 - Integrated interchip sound (I2S)

Human-Machine Interfaces (HMI)
 - General purpose input/output controller
        </description>
      </device>

      <!-- ******************************  MK11DN512Axxx5  ***************************** -->
      <device Dname="MK11DN512Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK11DA5.h"  define="MK11DN512Axxx5"/>
        <debug      svd="SVD\MK11DA5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512.FLM"        start="0x00000000"  size="0x80000"                  default="1"/>
        <book    name="Documents\K11P121M50SF4V2RM.pdf"         title="MK11DN512Axxx5 Reference Manual"/>
        <book    name="Documents\K11P121M50SF4V2.pdf"           title="MK11DN512Axxx5 Data Sheet"/>
        <description>
ARM Cortex-M4 DSP instruction support, running at up to 50 MHz

System
 - System integration module
 - Power management and mode controllers
 - Multiple power modes available based on run, wait, stop, and powerdown modes
 - Low-leakage wakeup unit
 - Miscellaneous control module
 - Crossbar switch
 - Peripheral bridge
 - Direct memory access (DMA) controller with multiplexer to increase available DMA requests.
 - External watchdog monitor
 - Watchdog

Clocks
 - Multiple clock generation options available from internally- and externally generated clocks
 - System oscillator to provide clock source for the MCU
 - RTC oscillator to provide clock source for the RTC

Security
 - Cyclic Redundancy Check module for error detection
 - Hardware encryption, along with a random number generator
 - Tamper detect and secure storage

Analog
 - High speed analog-to-digital converter
 - Comparator
 - Digital-to-analog converter
 - Internal voltage reference
 - Bandgap voltage reference

Timers
 - Programmable delay block
 - FlexTimers
 - Periodic interrupt timer
 - Low power timer
 - Carrier modulator transmitter
 - Independent real time clock

Communications
 - Serial peripheral interface
 - Inter-integrated circuit (I2C)
 - UART
 - Integrated interchip sound (I2S)

Human-Machine Interfaces (HMI)
 - General purpose input/output controller
        </description>
      </device>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K10D5">
      <description>Freescale Kinetis K10D 50MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK10DN128xxx5"/>
      <accept Dname="MK10DN32xxx5"/>
      <accept Dname="MK10DN64xxx5"/>
      <accept Dname="MK10DX128xxx5"/>
      <accept Dname="MK10DX32xxx5"/>
      <accept Dname="MK10DX64xxx5"/>
    </condition>

    <condition id="K10D5_ARMCC">
      <require condition="K10D5"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    
