t21/Walnut_X/Packages/.cache/Keil.Kinetis_K10_DFP.1.1.0.pdsc
    <condition id="K10D7">
      <description>Freescale Kinetis K10D 72MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK10DX128xxx7"/>
      <accept Dname="MK10DX256xxx7"/>
      <accept Dname="MK10DX64xxx7"/>
    </condition>

    <condition id="K10D7_ARMCC">
      <require condition="K10D7"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K10D10">
      <description>Freescale Kinetis K10D 100MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK10DN512xxx10"/>
      <accept Dname="MK10DX128xxx10"/>
      <accept Dname="MK10DX256xxx10"/>
    </condition>

    <condition id="K10D10_ARMCC">
      <require condition="K10D10"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K10F12">
      <description>Freescale Kinetis K10F 120MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK10FN1M0xxx12"/>
      <accept Dname="MK10FX512xxx12"/>
    </condition>

    <condition id="K10F12_ARMCC">
      <require condition="K10F12"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K11D5">
      <description>Freescale Kinetis K11D 50MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK11DN512xxx5"/>
      <accept Dname="MK11DX128xxx5"/>
      <accept Dname="MK11DX256xxx5"/>
    </condition>

    <condition id="K11D5_ARMCC">
      <require condition="K11D5"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K12D5">
      <description>Freescale Kinetis K12D 50MHz devices</description>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MK12DN512xxx5"/>
      <accept Dname="MK12DX128xxx5"/>
      <accept Dname="MK12DX256xxx5"/>
    </condition>

    <condition id="K12D5_ARMCC">
      <require condition="K12D5"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Kinetis K10 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Freescale device from K10 Series and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78" Dname="MK1*"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="K11DA5">
      <description>Freescale Kinetis K11DA 50MHz devices</description>
      <require Dvendor="Freescale:78" Dname="MK11D????Axxx5"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="K11DA5 CMSIS">
      <description>Freescale Kinetis K11DA 50MHz devices and CMSIS-CORE</description>
      <require condition="K11DA5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>
  <!-- examples>
  </examples -->

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Kinetis K10 CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Freescale K10 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_K10xx    /* Device Startup for K10 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_MK10D5.s"      attr="config"     version="1.0.0" condition="K10D5_ARMCC"/>
        <file category="source" name="Device\Source\ARM\startup_MK10D7.s"      attr="config"     version="1.0.0" condition="K10D7_ARMCC"/>
        <file category="source" name="Device\Source\ARM\startup_MK10D10.s"     attr="config"     version="1.0.0" condition="K10D10_ARMCC"/>
        <file category="source" name="Device\Source\ARM\startup_MK10F12.s"     attr="config"     version="1.0.0" condition="K10F12_ARMCC"/>
        <file category="source" name="Device\Source\ARM\startup_MK11D5.s"      attr="config"     version="1.0.0" condition="K11D5_ARMCC"/>
        <file category="source" name="Device\Source\ARM\startup_MK12D5.s"      attr="config"     version="1.0.0" condition="K12D5_ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device\Source\system_MK10D5.c"      attr="config"     version="1.0.0" condition="K10D5"/>
        <file category="source" name="Device\Source\system_MK10D7.c"      attr="config"     version="1.0.0" condition="K10D7"/>
        <file category="source" name="Device\Source\system_MK10D10.c"     attr="config"     version="1.0.0" condition="K10D10"/>
        <file category="source" name="Device\Source\system_MK10F12.c"     attr="config"     version="1.0.0" condition="K10F12"/>
        <file category="source" name="Device\Source\system_MK11D5.c"      attr="config"     version="1.0.0" condition="K11D5"/>
        <file category="source" name="Device\Source\system_MK12D5.c"      attr="config"     version="1.0.0" condition="K12D5"/>
        </files>
    </component>

    <!-- Startup K11DA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K11DA5 CMSIS">
      <description>System Startup for Freescale Kinetis K11DA 50MHz devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK11DA5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK11DA5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK11DA5.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MK11DA5.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

  </components>
</package>
